       IDENTIFICATION DIVISION.
      * PROGRAMME POUR GERER LES PERSONNAGES DE TRAVELLER
      * FAIS DANS UN BUT D ENTRAINEMENT EN COBOL
       PROGRAM-ID. CHARTRA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         01 CHARAC.
           05 CHAR-SNAME  PIC X(48).
           05 CHAR-NAME  PIC X(48).
           05 CARAC.
               10 STR PIC 9(2).
               10 DEX PIC 9(2).
       PROCEDURE DIVISION.
           ACCEPT CHAR-NAME.
           ACCEPT STR.
           DISPLAY 'FICHE PERSONNAGE'.
           DISPLAY 'NAME :' CHAR-NAME 
           DISPLAY 'FORCE    : ' STR.
           STOP RUN.