//CREACOPY JOB (TRAVEL),'ADD COPY',CLASS=A,MSGCLASS=X,  
//         USER=HERC01,PASSWORD=CUL8TR
//* UTILISATION DE IEBUPDTE POUR AJOUTER LE TEXTE DANS LA BIBLIOTHEQUE
//* APPRENTISSAGE POSSIBILITE AVEC UN JCL DE RAJOUTER DANS UN COPYBOOK
//STEP1    EXEC PGM=IEBUPDTE,PARM=NEW
//SYSUT2   DD DSN=HERC01.TRAVEL.COPYLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
./ ADD NAME=SKILLS
       05  SK-LIST.
           10 SK-BASIC.
              15  SK-BA-ADM-EPIC  PIC 9(3).
              15  SK-BA-BRI-EPIC  PIC 9(3).
./ ENDUP
/*
