      * COPY BOOK utilisation d'un copy book pour apprentissage 
       01  SK-LIST.
      * BASIC SKILLS FIRST 
           05 SK-BASIC.
      * BASIC SKILL : ADMINISTRATION SKILL 
              10  SK-BA-ADM  PIC 9(3).
      * BASIC SKILL : BRIBERY SKILL
              10  SK-BA-BRI  PIC 9(3). 
            
           