      * COPY BOOK utilisation d'un copy book pour apprentissage 
       05  SK-LIST.
      * BASIC SKILLS FIRST 
           10 SK-BASIC.
      * BASIC SKILL : ADMINISTRATION SKILL 
              15  SK-BA-ADM  PIC 9(3).
      * BASIC SKILL : BRIBERY SKILL
              15  SK-BA-BRI  PIC 9(3). 
            
           